fix(readme): edited readme with proper docs
